<!--协议政策详情-->
<template>
    <div id="root">
        <h2>验真平台隐私政策</h2>
        <p>尊敬的用户：</p>
        <p>我们非常重视您的隐私和个人信息保护。您在使用我们的产品与/或服务时，我们可能会收集和使用您的相关信息。我们希望通过《验真平台隐私政策（“本隐私政策”）向您说明我们在您使用我们的产品与/或服务时如何收集、使用、保存这些信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式。如果您不同意本隐私政策的任何内容，您应立即停止使用手机验证服务。当您使用我们提供的任一服务时，即表示您已同意我们按照本隐私政策来合法使用和保护您的个人信息。</p>
        <p>我们的产品与/或服务包括一些核心功能，这些功能包含了实现扫码验真所必须的功能、改进我们的产品与/或服务所必须的功能及保障交易安全所必须的功能。我们可能会收集、保存和使用下列与您有关的信息才能实现上述这些功能。如果您不提供相关信息，您将无法享受我们提供的产品与/或服务。</p>

        <h3>一、您须授权我们收集和使用您的个人信息包括：</h3>
        <ol>
            <li>（1）手机号注册。您首先需要验证手机号注册一个账户。当您注册时，您需要至少向我们提供您本人的手机号码，我们将通过发送短信验证码的方式来验证您的身份是否有效。您的账户名为您的微信默认昵称。</li>
            <li>（2）您的位置信息。当您使用我们的验真平台相关服务时，我们可能会读取您的位置（大多数移动设备将允许您关闭定位服务，具体建议您联系您的移动设备的服务商或生产商）。</li>
            <li>（3）您的设备信息。我们可能会读取您或使用验真服务时所使用的终端设备的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。</li>
            <li>（4）您的行为或相关访问信息。我们可能会记录您使用验真服务时所进行的操作以及您在平台上进行访问的相关信息。</li>
        </ol>

        <h3>二、来自第三方的信息</h3>
        <p>指在您注册验真平台账户和使用服务过程中，您授权验真平台可向验真平台的关联方、合作伙伴获取其所收集的相关信息。这些信息包括但不限于您的身份信息、行为信息、设备信息等，我们会将此类信息汇总，用于帮助您提供更好以及更加个性化的服务或更好的预防互联网欺诈。</p>

        <h3>三、我们对您个人信息的管理和使用</h3>
        <p>为向您提供服务、提升我们的服务质量以及优化您的服务体验，我们会在符合法律规定下使用您的个人信息，并主要用于下列用途：</p>
        <ol>
            <li>1、向您提供您使用的各项服务，并维护、改进这些服务。</li>
            <li>2、我们可能会将来自某项服务的个人信息与来自其他服务所获得的信息结合起来，用于为了给您提供更加个性化的服务使用。</li>
            <li>3、经您同意或授权的其他用途。</li>
        </ol>

        <h3>四、您个人信息的分享</h3>
        <p>您的个人信息是我们为您提供服务的重要部分，我们会遵循法律规定对您的信息承担保密义务。除以下情形外，我们不会将您的个人信息披露给第三方：</p>
        <ol>
            <li>1、征得您的同意或授权。</li>
            <li>2、根据法律法规的规定或行政或司法机构的要求。</li>
            <li>3、只有共享您的信息，才能提供您需要的服务，或处理您与他人的纠纷或争议。</li>
            <li>4、您出现违反中国有关法律、法规规定或者违反您与我们签署的相关协议（包括在线签署的电子协议）。</li>
        </ol>

        <h3>五、您个人信息的安全</h3>
        <p>我们严格保护您的个人信息安全。我们使用各种制度、安全技术和程序等措施来保护您的个人信息不被未经授权的访问、篡改、披露或破坏。</p>

        <div>
            <button type="button" id="back" @click="policyClose">返回</button>
        </div>
    </div>
</template>

<script type="text/javascript">
    export default {
      data() {
        return {

        }
      },
      methods: {
        policyClose() {
          this.$emit('policyClose')
        }
      }
    }
</script>

<style  lang="scss" scoped>
    * {
        box-sizing: border-box;
        margin: 0;
        padding: 0;
    }

    #root {
        width: 100%;
        height: 100%;
        background: #fff;
        padding: 48px 36px;
        overflow-y: auto;
        padding-bottom: 110px;
        position: fixed;
        top: 0;
        left: 0;
        z-index: 999;
        text-align: left;
        h2 {
            color: #0085DA;
            font-size: 40px;
            margin-bottom: 30px;
            text-align: center;
        }
        p, h3, li {
            color: #141000;
            font-size: 24px;
            line-height: 60px;
        }
        h3 {
            font-weight: bold;
            margin-top: 10px;
        }

        #back {
            width: 202px;
            height: 63px;
            background: none;
            border: 1px solid #0085DA;
            color: #0085DA;
            font-size: 36px;
            display: block;
            letter-spacing: 20px;
            text-indent: 20px;
            margin: 50px auto 0;
        }
    }

</style>

